Revit 2027 API
FailureMessage.SetFailingElement Method
 Sets the element that has caused the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureMessage SetFailingElement(
	ElementId id
)
Public Function SetFailingElement (
	id As ElementId
) As FailureMessage
public:
FailureMessage^ SetFailingElement(
	ElementId^ id
)
member SetFailingElement :
        id : ElementId -> FailureMessage
Parameters
id ElementId
 The element that has caused the failure.
Return Value
FailureMessage
 The FailureMessage.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FailureMessage is already posted to a document
Remarks
 In Revit error dialog this element will be highlighted to the user and can be deleted by user via extended error dialog.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace